app/controllers/charges_controller.rb

  def index
  	@transactions = Transaction.where("user_id=?",current_user.id)
---
SELECT "transactions".* FROM "transactions"  WHERE (user_id=1)

  def create
    # Amount in cents
    Stripe.api_key = get_stripe_settings[Rails.env]["stripe"]["secret_key"]
    amount = 10.to_i * 100

    # Create the customer in Stripe
    customer = Stripe::Customer.create(
      email: current_user.email,
      card: params[:stripeToken]
    )

    # Create the charge using the customer data returned by Stripe API
    charge = Stripe::Charge.create(
      customer: customer.id,
      amount: amount,
      description: 'Rails Stripe customer',
      currency: 'usd'
    )
    #add transaction for user.
    Transaction.create({user_id: current_user.id, amount: amount, transaction_number: params[:stripeToken]})
---
INSERT INTO "transactions" ("amount", "created_at", "transaction_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["amount", 1000.0], ["created_at", "2016-07-15 11:50:12.762468"], ["transaction_number", "tok_18XUp0LaWMsWaYfCnVeyW1z1"], ["updated_at", "2016-07-15 11:50:12.762468"], ["user_id", 1]]